Documents/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>Продажи</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиПоМестамХранения</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТочкаПродажи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПродажи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Продажи/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
  	 СторокаСТоваром = Элементы.Товары.ТекущиеДанные;
	 СторокаСТоваром.СуммаНДС =  ПолучитьСуммуНДС(СторокаСТоваром.Цена * СторокаСТоваром.Количество, ПолучитьСтавкуНДС());
	 СторокаСТоваром.СуммаПродажи = РасчетСуммы(СторокаСТоваром.Цена, СторокаСТоваром.Количество);
 КонецПроцедуры
 
 
 Функция РасчетСуммы(Цена, Количество);
	  Сумма =  Цена * Количество;
	  СуммаНДС = ПолучитьСуммуНДС(Сумма,ПолучитьСтавкуНДС());
      Возврат Сумма + СуммаНДС;	 
 КонецФункции
 
 Функция ПолучитьСуммуНДС(Сумма, СтавкаНДС);
	 Возврат Сумма / 100 * СтавкаНДС;	 
КонецФункции

Функция ПолучитьСтавкуНДС()
	
	Возврат Константы.СтавкаНДС.Получить();
КонецФункции

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	 СторокаСТоваром = Элементы.Товары.ТекущиеДанные;
	 СторокаСТоваром.СуммаНДС =  ПолучитьСуммуНДС(СторокаСТоваром.Цена * СторокаСТоваром.Количество, ПолучитьСтавкуНДС());
	 СторокаСТоваром.СуммаПродажи = РасчетСуммы(СторокаСТоваром.Цена, СторокаСТоваром.Количество);
КонецПроцедуры
